let LIST = [{"value":1,"label":"Благоустройство территории"},{"value":2,"label":"Вывоз асфальтового скола"},{"value":3,"label":"Вывоз мусора"},{"value":4,"label":"Вывоз смёта"},{"value":5,"label":"Вывоз снега"},{"value":6,"label":"Заливка трещин дорожных покрытий"},{"value":7,"label":"Земляные работы"},{"value":8,"label":"Механизированная обработка тротуаров"},{"value":9,"label":"Мойка внутриквартальных проездов"},{"value":10,"label":"Мойка дорожных знаков"},{"value":11,"label":"Мойка ДТ"},{"value":12,"label":"Нанесение линий вертикальной дорожной разметки"},{"value":13,"label":"Обработка внутриквартальных проездов комбинированным ПГР"},{"value":14,"label":"Обработка ДТ комбинированным ПГР"},{"value":15,"label":"Оперативный вывоз снега"},{"value":16,"label":"Опиловка"},{"value":17,"label":"Перевозка груза"},{"value":18,"label":"Перевозка пассажиров"},{"value":19,"label":"Перекидка валов снега из лотков и с обочин"},{"value":20,"label":"ПМ Мойка лотков в ночное время"},{"value":21,"label":"ПМ Мойка осевых РП"},{"value":22,"label":"ПМ Мойка проезжей части"},{"value":23,"label":"ПМ Полив проезжей части"},{"value":24,"label":"Погрузочно-разгрузочные работы"},{"value":25,"label":"Подметание внутриквартальных проездов"},{"value":26,"label":"Подметание проезжей части"},{"value":27,"label":"Подметание с увлажнением ДТ"},{"value":28,"label":"Подметание снега с внутриквартальных проездов"},{"value":29,"label":"Подметание снега с ДТ"},{"value":30,"label":"Полив клумб, газонов и кустарника"},{"value":31,"label":"ПУ Патрульное подметание лотков"},{"value":32,"label":"ПУ Подметание лотков"},{"value":33,"label":"ПУ Подметание осевых РП"},{"value":34,"label":"Работа вышки"},{"value":35,"label":"Расчистка от снега обочин"},{"value":36,"label":"Расчитска снега на остановках и переходах"},{"value":37,"label":"Ремонт барьерных ограждений"},{"value":38,"label":"Ремонт дорожных покрытий"},{"value":39,"label":"Ремонт дорожных покрытий гор. асфальтобетоном"},{"value":40,"label":"Ремонт проезжей части литым асфальтобетоном"},{"value":41,"label":"РЖР"},{"value":42,"label":"РТР"},{"value":43,"label":"Ручная уборка труднодоступных участков проезжей части"},{"value":44,"label":"ТУ Мойка тротуаров"},{"value":45,"label":"ТУ Мойка тротуаров со шлангом"},{"value":46,"label":"Уборка выделителей полос движения"},{"value":47,"label":"Уборка МБО и ШЗС"},{"value":48,"label":"Укладка асфальта"},{"value":49,"label":"Укрепление обочин"},{"value":50,"label":"Формирование вала"},{"value":51,"label":"Эксплуатация тягачей"}];



export function getWorkTypeById(id) {
	let result;
	_.each(LIST, (car) => {
		if (car.id === id) {
			result = car;
		}
	})

	return !!result ? result : {};
}

export default LIST;